const counter = document.querySelector(".counterButton");

// 👇🏻 مكان النقاط count قم بتعيين القيمة صفر إلى المتغير
// ...

counter.addEventListener("click", incrementCounter);

/******************************************************
 *  هي أداة تقوم بتكرار الكود الذي incrementCounter()  *
 *  تكتبه داخلها كلما ضغطت على الزر                    *
 ******************************************************/

function incrementCounter() {
  // 👇🏻 بواحد مكان النقاط count قم بزيادة قيمة
  // ...
  counter.innerHTML = count;
  // "تسوي 1 اطبع "جيد count إن كانت قيمة العداد أو
  if (condition) {
    document.getElementById("status").innerHTML = "جيد";
  }
  // "أكبر من 1 وأقل من 6 اطبع "جيد جداً count إن كانت قيمة العداد أو
  // "أكبر من أو تساوي 6 اطبع "رائع count إن كانت قيمة العداد أو
}
